def task_1(two_dim_words):
    """
        Здесь должен быть ваш код.
        Переменная two_dim_words - ваш двумерный список.
        Заполнять список значениями не нужно.
        Финальное значение должно быть помещено в переменную sorted_words.
        """

    pass


def task_3(numbers):
    """
        Здесь должен быть ваш код.
        Переменная numbers - ваша строка чисел.
        Финальное значение должно быть помещено в переменную dict_min.
        """

    pass


def task_4_1(words):
    """
        Здесь должен быть ваш код.
        Переменная words - ваш кортеж слов из задания.
        Финальное значение должно быть помещено в переменную res.
        """

    pass


def task_4_2(words):  # можно сделать тесты
    """
        Здесь должен быть ваш код.
        Переменная words - ваш кортеж слов из задания.
        Финальное значение должно быть помещено в переменную res.
        """

    pass


def task_4_3(words):
    """
        Здесь должен быть ваш код.
        Переменная words - ваш кортеж слов из задания.
        Финальное значение должно быть помещено в переменную res.
        """

    pass


def task_5(lst1, lst2):
    
    lst1 = {3, 4, 2, 1, 5, 6}
    lst2 = {4, 5, 6}
    diff = list(lst1.difference(lst2))
    print(set(sorted(diff)))

    return diff


def task_6(lst):
    
    lst = [1, 2, 2, 3, 3, 4, 5]
    res = sorted(lst, reverse=True)
    print(tuple(res))

    return res

